# tap repositories and their packages
## argon/mas
tap  "argon/mas"
brew "argon/mas/mas"

## homebrew/bundle
tap  "homebrew/bundle"

## Formula for defining package
tap  "homebrew/core"

## neovim/neovim
tap  "neovim/neovim"
brew "neovim"

## ngrok
cask "ngrok"

## sanemat/font
tap  "sanemat/font"
cask "xquartz"
brew "ricty"

# other homebrew packages
## GPG (GNU Privacy Guard)
brew "adns"
brew "libassuan"
brew "libgcrypt"
brew "libidn2"
brew "libksba"
brew "libusb"
brew "npth"
brew "pinentry"
brew "gnupg"

brew "amazon-ecs-cli"
brew "ansible"
brew "autoconf"
brew "automake"
brew "bash"
brew "bash-completion"
brew "berkeley-db"
brew "brew-cask-completion"
brew "cmake"
brew "colordiff"
brew "circleci"
brew "csshx"
brew "ctags"
brew "ctop"
brew "dep"
brew "diff-so-fancy"
brew "direnv"
brew "dmd"
brew "dub"
brew "eigen"
brew "ffmpeg"
brew "fish"
brew "fontconfig"
brew "fping"
brew "freetype"
brew "fribidi"
brew "fzf"
brew "gcc"
brew "gd"
brew "genext2fs"
brew "gettext"
brew "gibo"
brew "git"
brew "github/gh/gh"
brew "ghq"
brew "glib"
brew "gmp"
brew "gnutls"
brew "goenv"
brew "graphviz"
brew "htop-osx"
brew "hub", args: ["HEAD"]
brew "icu4c"
brew "ilmbase"
brew "imagemagick"
brew "isl"
brew "jemalloc"
brew "jpeg"
brew "jq"
brew "jo"
brew "jsonnet"
brew "kotlin"
brew "kubernetes-helm"
brew "lame"
brew "libevent"
brew "libffi"
brew "libgcrypt"
brew "libgpg-error"
brew "libmagic"
brew "libmpc"
brew "libpng"
brew "libtasn1"
brew "libtermkey"
brew "libtiff"
brew "libtool"
brew "libunistring"
brew "libuv"
brew "libvterm"
brew "little-cms2"
brew "lua"
brew "mobile-shell"
brew "mono"
brew "mpfr"
brew "msgpack"
brew "mtr"
brew "nettle"
brew "nodebrew"
brew "numpy"
brew "oniguruma"
brew "openexr"
brew "ossp-uuid"
brew "packer"
brew "pkg-config"
brew "pcre"
brew "perl"
brew "pdsh"
brew "pixman"
brew "popt"
brew "protobuf"
brew "pyenv"
brew "rbenv"
brew "pyenv-virtualenv"
brew "rbenv-gemset"
brew "redis"
brew "rename"
brew "rethinkdb"
brew "ruby"
brew "ruby-build"
brew "sbt"
brew "scalaenv"
brew "sdl"
brew "sdl2"
brew "shellcheck"
brew "sipcalc"
brew "slackcat"
brew "ssh-copy-id"
brew "stern"
brew "stoken"
brew "terraform"
brew "tfenv"
brew "the_silver_searcher"
brew "tig"
brew "tmux", args: ["HEAD"]
brew "tree"
brew "unibilium"
brew "utf8proc"
brew "vegeta"
brew "vim"
brew "wallpaper"
brew "watch"
brew "webp"
brew "wget"
brew "wrk"
brew "xvid"
brew "xz"
brew "x264"
brew "yajl"

## GUI application (dir: /Applications/*)
cask "alfred"
cask "appcleaner"
cask "boostnote"
cask "docker"
cask "dropbox"
cask "duet"
cask "evernote"
cask "geektool"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "inkdrop"
cask "iterm2"
cask "itsycal"
cask "java"
cask "licecap"
cask "macs-fan-control"
cask "tunnelblick"
cask "visual-studio-code"
cask "xrg"

## Application of mac app store
mas "Air Display",                 id: 419449719
mas "Art Text 3",                  id: 1084658654
mas "Deckset",                     id: 847496013
mas "Fotor Photo Editor",          id: 503039729
mas "Slack",                       id: 803453959
