# Tap repositories and their packages
## Formula for defining package
tap "homebrew/core"

## kubesec
tap "shyiko/kubesec"
brew "kubesec"

## Neovim
tap  "neovim/neovim"
brew "neovim"

## Nerd Font
tap "homebrew/cask-fonts"
brew "font-hack-nerd-font"

## Telepresence
tap "datawire/blackbird"
brew "telepresence"

# Other Homebrew Packages
## GPG (GNU Privacy Guard)
brew "adns"
brew "libassuan"
brew "libgcrypt"
brew "libidn2"
brew "libksba"
brew "libusb"
brew "npth"
brew "pinentry"
brew "gnupg"

brew "act"
brew "akamai"
brew "amazon-ecs-cli"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bash-completion"
brew "bash"
brew "bat"
brew "berkeley-db", link: true
brew "brew-cask-completion"
brew "cairo"
brew "cmake"
brew "colordiff"
brew "csshx"
brew "ctags"
brew "ctop"
brew "curl"
brew "diff-so-fancy"
brew "direnv"
brew "dub"
brew "eigen"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fontconfig"
brew "fontforge"
brew "fping"
brew "freetype"
brew "fribidi"
brew "fzf"
brew "gcc"
brew "gd"
brew "gdk-pixbuf"
brew "genext2fs"
brew "gettext"
brew "ghostscript"
brew "gh"
brew "ghq"
brew "gibo"
brew "git"
brew "glib"
brew "gmp"
brew "gnutls"
brew "gobject-introspection"
brew "gping"
brew "graphviz"
brew "grep"
brew "guile"
brew "helm"
brew "htop"
brew "hub", args: ["HEAD"]
brew "imagemagick"
brew "isl"
brew "istioctl"
brew "jemalloc"
brew "jo"
brew "jpeg-xl"
brew "jpeg", link: true
brew "jq"
brew "jsonnet"
brew "k6"
brew "k9s"
brew "kotlin"
brew "kubeconform"
brew "kubent"
brew "kubevela"
brew "kustomize"
brew "lame"
brew "leptonica"
brew "libarchive"
brew "libevent"
brew "libgpg-error"
brew "libheif"
brew "libmagic"
brew "libmpc"
brew "libpng"
brew "librsvg"
brew "libssh2"
brew "libtasn1"
brew "libtermkey"
brew "libtiff"
brew "libtool"
brew "libunistring"
brew "libuv"
brew "libvterm"
brew "little-cms2"
brew "lsd"
brew "lua"
brew "mas"
brew "mono"
brew "mosh"
brew "mpfr"
brew "msgpack"
brew "mtr"
brew "navi"
brew "netpbm"
brew "nettle"
brew "nghttp2"
brew "nodebrew"
brew "numpy"
brew "oniguruma"
brew "openblas"
brew "openexr"
brew "openjdk"
brew "openjpeg"
brew "openldap"
brew "openssl@1.1"
brew "ossp-uuid"
brew "p11-kit"
brew "packer"
brew "pango"
brew "pcre"
brew "pdsh"
brew "perl"
brew "pipenv"
brew "pixman"
brew "pkg-config"
brew "popt"
brew "procs"
brew "protobuf"
brew "pyenv-virtualenv"
brew "pyenv"
brew "python@3.10"
brew "rbenv-gemset"
brew "rbenv"
brew "redis"
brew "rename"
brew "ripgrep"
brew "ruby-build"
brew "ruby"
brew "rustup-init"
brew "sdl2"
brew "sheldon"
brew "shellcheck"
brew "sipcalc"
brew "srt"
brew "ssh-copy-id", link: true
brew "starship"
brew "stern"
brew "stoken"
brew "tfenv"
brew "the_silver_searcher"
brew "tig"
brew "tmux", args: ["HEAD"]
brew "tree"
brew "unbound"
brew "unibilium"
brew "utf8proc"
brew "viddy"
brew "vim"
brew "wallpaper"
brew "watch"
brew "webp"
brew "wget"
brew "whalebrew"
brew "wrk"
brew "xz"
brew "x264"
brew "xvid"
brew "yajl"
brew "yarn"
brew "yq"
brew "zsh"
brew "zstd"

# GUI application (dir: /Applications/*)
cask "appcleaner"
cask "deepl"
cask "docker"
cask "discord"
cask "dropbox"
cask "duet"
cask "elgato-stream-deck"
cask "geektool"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "itsycal"
cask "kitty"
cask "licecap"
cask "logi-options+"
cask "macs-fan-control"
cask "ngrok"
cask "obsidian"
cask "raycast"
cask "slack"
cask "visual-studio-code"
cask "wondershare-filmora"
cask "xrg"
cask "zoom"

# Applications in the Mac App Store
mas "Keynote", id: 409183694
mas "LINE",    id: 539883307

# Extensions for Visual Studio Code
vscode "4ops.terraform"
vscode "766b.go-outliner"
vscode "aaron-bond.better-comments"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "asdine.cue"
vscode "bierner.markdown-preview-github-styles"
vscode "DavidAnson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "GitHub.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "mechatroner.rainbow-csv"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-vscode-remote.remote-containers"
vscode "MS-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "premparihar.gotestexplorer"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "shardulm94.trailing-spaces"
vscode "streetsidesoftware.code-spell-checker"
vscode "TabNine.tabnine-vscode"
vscode "thomas-baumgaertner.vcl"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
