tap "argon/mas"
tap "aspnet/k"
tap "caskroom/cask"
tap "homebrew/binary"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/python"
tap "homebrew/science"
tap "neovim/neovim"
cask "java"
brew "ansible"
brew "autoconf"
brew "automake"
brew "bash"
brew "berkeley-db"
brew "cmake"
brew "colordiff"
brew "csshx"
brew "ctags"
brew "diff-so-fancy"
brew "direnv"
brew "eigen"
brew "libpng"
brew "freetype"
brew "fontconfig"
brew "fzf"
brew "gmp"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "jpeg"
brew "libtiff"
brew "webp"
brew "gd"
brew "genext2fs"
brew "gettext"
brew "git"
brew "libffi"
brew "pcre"
brew "glib"
brew "libtasn1"
brew "libunistring"
brew "nettle"
brew "gnutls"
brew "go"
brew "libtool"
brew "graphviz"
brew "htop-osx"
brew "hub", args: ["HEAD"]
brew "icu4c"
brew "ilmbase"
brew "jemalloc"
brew "oniguruma"
brew "jq"
brew "libevent"
brew "libgpg-error"
brew "libgcrypt"
brew "libmagic"
brew "libtermkey"
brew "libuv"
brew "libvterm"
brew "little-cms2"
brew "lua"
brew "protobuf"
brew "mobile-shell"
brew "mongodb"
brew "mono"
brew "msgpack"
brew "unibilium"
brew "neovim"
brew "nodebrew"
brew "numpy"
brew "openexr"
brew "ossp-uuid"
brew "packer"
brew "pdsh"
brew "pixman"
brew "popt"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "rbenv-gemset"
brew "rethinkdb"
brew "xz"
brew "rpm"
brew "sbt"
brew "sdl"
brew "sdl2"
brew "shellcheck"
brew "sipcalc"
brew "slackcat"
brew "stoken"
brew "terraform"
brew "the_silver_searcher"
brew "tig"
brew "tmux", args: ["HEAD"]
brew "tree"
brew "utf8proc"
brew "vegeta"
brew "vim", args: ["with-lua"]
brew "watch"
brew "wget"
brew "wrk"
brew "yajl"
brew "argon/mas/mas"
brew "homebrew/science/opencv"
brew "homebrew/science/pillow"
mas "Air Display", id: 419449718
mas "Alfred", id: 405843582
mas "Deckset", id: 847496013
mas "Evernote", id: 406056744
mas "LINE", id: 539883307
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
